benchmark/results/run-20260427-031037/monolith-run1-k6.log

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: k6/test.js
        output: -

     scenarios: (100.00%) 1 scenario, 200 max VUs, 2m0s max duration (incl. graceful stop):
              * default: Up to 200 looping VUs for 1m30s over 3 stages (gracefulRampDown: 30s, gracefulStop: 30s)


running (0m01.0s), 001/200 VUs, 0 complete and 0 interrupted iterations
default   [   1% ] 001/200 VUs  0m01.0s/1m30.0s

running (0m02.0s), 001/200 VUs, 1 complete and 0 interrupted iterations
default   [   2% ] 001/200 VUs  0m02.0s/1m30.0s

running (0m03.0s), 001/200 VUs, 2 complete and 0 interrupted iterations
default   [   3% ] 001/200 VUs  0m03.0s/1m30.0s

running (0m04.0s), 002/200 VUs, 3 complete and 0 interrupted iterations
default   [   4% ] 002/200 VUs  0m04.0s/1m30.0s

running (0m05.0s), 002/200 VUs, 5 complete and 0 interrupted iterations
default   [   6% ] 002/200 VUs  0m05.0s/1m30.0s

running (0m06.0s), 002/200 VUs, 7 complete and 0 interrupted iterations
default   [   7% ] 002/200 VUs  0m06.0s/1m30.0s

running (0m07.0s), 003/200 VUs, 9 complete and 0 interrupted iterations
default   [   8% ] 003/200 VUs  0m07.0s/1m30.0s

running (0m08.0s), 003/200 VUs, 12 complete and 0 interrupted iterations
default   [   9% ] 003/200 VUs  0m08.0s/1m30.0s

running (0m09.0s), 003/200 VUs, 15 complete and 0 interrupted iterations
default   [  10% ] 003/200 VUs  0m09.0s/1m30.0s

running (0m10.0s), 003/200 VUs, 18 complete and 0 interrupted iterations
default   [  11% ] 003/200 VUs  0m10.0s/1m30.0s

running (0m11.0s), 004/200 VUs, 21 complete and 0 interrupted iterations
default   [  12% ] 004/200 VUs  0m11.0s/1m30.0s

running (0m12.0s), 004/200 VUs, 25 complete and 0 interrupted iterations
default   [  13% ] 004/200 VUs  0m12.0s/1m30.0s

running (0m13.0s), 004/200 VUs, 29 complete and 0 interrupted iterations
default   [  14% ] 004/200 VUs  0m13.0s/1m30.0s

running (0m14.0s), 005/200 VUs, 33 complete and 0 interrupted iterations
default   [  16% ] 005/200 VUs  0m14.0s/1m30.0s

running (0m15.0s), 005/200 VUs, 38 complete and 0 interrupted iterations
default   [  17% ] 005/200 VUs  0m15.0s/1m30.0s

running (0m16.0s), 005/200 VUs, 43 complete and 0 interrupted iterations
default   [  18% ] 005/200 VUs  0m16.0s/1m30.0s

running (0m17.0s), 006/200 VUs, 48 complete and 0 interrupted iterations
default   [  19% ] 006/200 VUs  0m17.0s/1m30.0s

running (0m18.0s), 006/200 VUs, 54 complete and 0 interrupted iterations
default   [  20% ] 006/200 VUs  0m18.0s/1m30.0s

running (0m19.0s), 006/200 VUs, 60 complete and 0 interrupted iterations
default   [  21% ] 006/200 VUs  0m19.0s/1m30.0s

running (0m20.0s), 006/200 VUs, 66 complete and 0 interrupted iterations
default   [  22% ] 006/200 VUs  0m20.0s/1m30.0s

running (0m21.0s), 007/200 VUs, 72 complete and 0 interrupted iterations
default   [  23% ] 007/200 VUs  0m21.0s/1m30.0s

running (0m22.0s), 007/200 VUs, 79 complete and 0 interrupted iterations
default   [  24% ] 007/200 VUs  0m22.0s/1m30.0s

running (0m23.0s), 007/200 VUs, 86 complete and 0 interrupted iterations
default   [  26% ] 007/200 VUs  0m23.0s/1m30.0s

running (0m24.0s), 008/200 VUs, 93 complete and 0 interrupted iterations
default   [  27% ] 008/200 VUs  0m24.0s/1m30.0s

running (0m25.0s), 008/200 VUs, 101 complete and 0 interrupted iterations
default   [  28% ] 008/200 VUs  0m25.0s/1m30.0s

running (0m26.0s), 008/200 VUs, 109 complete and 0 interrupted iterations
default   [  29% ] 008/200 VUs  0m26.0s/1m30.0s

running (0m27.0s), 009/200 VUs, 117 complete and 0 interrupted iterations
default   [  30% ] 009/200 VUs  0m27.0s/1m30.0s

running (0m27.9s), 009/200 VUs, 126 complete and 0 interrupted iterations
default   [  31% ] 009/200 VUs  0m28.0s/1m30.0s

running (0m28.9s), 009/200 VUs, 135 complete and 0 interrupted iterations
default   [  32% ] 009/200 VUs  0m29.0s/1m30.0s

running (0m29.9s), 009/200 VUs, 144 complete and 0 interrupted iterations
default   [  33% ] 009/200 VUs  0m30.0s/1m30.0s

running (0m30.9s), 011/200 VUs, 153 complete and 0 interrupted iterations
default   [  34% ] 011/200 VUs  0m31.0s/1m30.0s

running (0m31.9s), 012/200 VUs, 164 complete and 0 interrupted iterations
default   [  36% ] 012/200 VUs  0m32.0s/1m30.0s

running (0m32.9s), 013/200 VUs, 176 complete and 0 interrupted iterations
default   [  37% ] 013/200 VUs  0m33.0s/1m30.0s

running (0m33.9s), 015/200 VUs, 189 complete and 0 interrupted iterations
default   [  38% ] 015/200 VUs  0m34.0s/1m30.0s

running (0m34.9s), 016/200 VUs, 203 complete and 0 interrupted iterations
default   [  39% ] 016/200 VUs  0m35.0s/1m30.0s

running (0m35.9s), 017/200 VUs, 219 complete and 0 interrupted iterations
default   [  40% ] 017/200 VUs  0m36.0s/1m30.0s

running (0m36.9s), 019/200 VUs, 236 complete and 0 interrupted iterations
default   [  41% ] 019/200 VUs  0m37.0s/1m30.0s

running (0m37.9s), 020/200 VUs, 255 complete and 0 interrupted iterations
default   [  42% ] 020/200 VUs  0m38.0s/1m30.0s

running (0m38.9s), 021/200 VUs, 275 complete and 0 interrupted iterations
default   [  43% ] 021/200 VUs  0m39.0s/1m30.0s

running (0m39.9s), 023/200 VUs, 296 complete and 0 interrupted iterations
default   [  44% ] 023/200 VUs  0m40.0s/1m30.0s

running (0m40.9s), 024/200 VUs, 319 complete and 0 interrupted iterations
default   [  46% ] 024/200 VUs  0m41.0s/1m30.0s

running (0m41.9s), 025/200 VUs, 343 complete and 0 interrupted iterations
default   [  47% ] 025/200 VUs  0m42.0s/1m30.0s

running (0m42.9s), 027/200 VUs, 368 complete and 0 interrupted iterations
default   [  48% ] 027/200 VUs  0m43.0s/1m30.0s

running (0m43.9s), 028/200 VUs, 395 complete and 0 interrupted iterations
default   [  49% ] 028/200 VUs  0m44.0s/1m30.0s

running (0m44.9s), 029/200 VUs, 423 complete and 0 interrupted iterations
default   [  50% ] 029/200 VUs  0m45.0s/1m30.0s

running (0m45.9s), 031/200 VUs, 452 complete and 0 interrupted iterations
default   [  51% ] 031/200 VUs  0m46.0s/1m30.0s

running (0m46.9s), 032/200 VUs, 483 complete and 0 interrupted iterations
default   [  52% ] 032/200 VUs  0m47.0s/1m30.0s

running (0m47.9s), 033/200 VUs, 515 complete and 0 interrupted iterations
default   [  53% ] 033/200 VUs  0m48.0s/1m30.0s

running (0m48.9s), 035/200 VUs, 548 complete and 0 interrupted iterations
default   [  54% ] 035/200 VUs  0m49.0s/1m30.0s

running (0m49.9s), 036/200 VUs, 583 complete and 0 interrupted iterations
default   [  56% ] 036/200 VUs  0m50.0s/1m30.0s

running (0m50.9s), 037/200 VUs, 619 complete and 0 interrupted iterations
default   [  57% ] 037/200 VUs  0m51.0s/1m30.0s

running (0m51.9s), 039/200 VUs, 654 complete and 0 interrupted iterations
default   [  58% ] 039/200 VUs  0m52.0s/1m30.0s

running (0m52.9s), 040/200 VUs, 693 complete and 0 interrupted iterations
default   [  59% ] 040/200 VUs  0m53.0s/1m30.0s

running (0m53.9s), 041/200 VUs, 733 complete and 0 interrupted iterations
default   [  60% ] 041/200 VUs  0m54.0s/1m30.0s

running (0m54.9s), 043/200 VUs, 774 complete and 0 interrupted iterations
default   [  61% ] 043/200 VUs  0m55.0s/1m30.0s

running (0m55.9s), 044/200 VUs, 815 complete and 0 interrupted iterations
default   [  62% ] 044/200 VUs  0m56.0s/1m30.0s

running (0m56.9s), 045/200 VUs, 859 complete and 0 interrupted iterations
default   [  63% ] 045/200 VUs  0m57.0s/1m30.0s

running (0m57.9s), 047/200 VUs, 903 complete and 0 interrupted iterations
default   [  64% ] 047/200 VUs  0m58.0s/1m30.0s

running (0m58.9s), 048/200 VUs, 950 complete and 0 interrupted iterations
default   [  66% ] 048/200 VUs  0m59.0s/1m30.0s

running (0m59.9s), 049/200 VUs, 998 complete and 0 interrupted iterations
default   [  67% ] 049/200 VUs  1m00.0s/1m30.0s

running (1m00.9s), 054/200 VUs, 1045 complete and 0 interrupted iterations
default   [  68% ] 054/200 VUs  1m01.0s/1m30.0s

running (1m01.9s), 059/200 VUs, 1099 complete and 0 interrupted iterations
default   [  69% ] 059/200 VUs  1m02.0s/1m30.0s

running (1m02.9s), 064/200 VUs, 1158 complete and 0 interrupted iterations
default   [  70% ] 064/200 VUs  1m03.0s/1m30.0s

running (1m03.9s), 069/200 VUs, 1222 complete and 0 interrupted iterations
default   [  71% ] 069/200 VUs  1m04.0s/1m30.0s

running (1m04.9s), 074/200 VUs, 1291 complete and 0 interrupted iterations
default   [  72% ] 074/200 VUs  1m05.0s/1m30.0s

running (1m05.9s), 079/200 VUs, 1365 complete and 0 interrupted iterations
default   [  73% ] 079/200 VUs  1m06.0s/1m30.0s

running (1m06.9s), 084/200 VUs, 1444 complete and 0 interrupted iterations
default   [  74% ] 084/200 VUs  1m07.0s/1m30.0s

running (1m07.9s), 089/200 VUs, 1526 complete and 0 interrupted iterations
default   [  76% ] 089/200 VUs  1m08.0s/1m30.0s

running (1m08.9s), 094/200 VUs, 1615 complete and 0 interrupted iterations
default   [  77% ] 094/200 VUs  1m09.0s/1m30.0s

running (1m09.9s), 099/200 VUs, 1707 complete and 0 interrupted iterations
default   [  78% ] 099/200 VUs  1m10.0s/1m30.0s

running (1m10.9s), 104/200 VUs, 1806 complete and 0 interrupted iterations
default   [  79% ] 104/200 VUs  1m11.0s/1m30.0s

running (1m11.9s), 109/200 VUs, 1910 complete and 0 interrupted iterations
default   [  80% ] 109/200 VUs  1m12.0s/1m30.0s

running (1m12.9s), 114/200 VUs, 2019 complete and 0 interrupted iterations
default   [  81% ] 114/200 VUs  1m13.0s/1m30.0s

running (1m13.9s), 119/200 VUs, 2133 complete and 0 interrupted iterations
default   [  82% ] 119/200 VUs  1m14.0s/1m30.0s

running (1m14.9s), 124/200 VUs, 2246 complete and 0 interrupted iterations
default   [  83% ] 124/200 VUs  1m15.0s/1m30.0s

running (1m15.9s), 129/200 VUs, 2370 complete and 0 interrupted iterations
default   [  84% ] 129/200 VUs  1m16.0s/1m30.0s

running (1m16.9s), 134/200 VUs, 2499 complete and 0 interrupted iterations
default   [  86% ] 134/200 VUs  1m17.0s/1m30.0s

running (1m17.9s), 139/200 VUs, 2633 complete and 0 interrupted iterations
default   [  87% ] 139/200 VUs  1m18.0s/1m30.0s

running (1m18.9s), 144/200 VUs, 2771 complete and 0 interrupted iterations
default   [  88% ] 144/200 VUs  1m19.0s/1m30.0s

running (1m19.9s), 149/200 VUs, 2915 complete and 0 interrupted iterations
default   [  89% ] 149/200 VUs  1m20.0s/1m30.0s

running (1m20.9s), 154/200 VUs, 3064 complete and 0 interrupted iterations
default   [  90% ] 154/200 VUs  1m21.0s/1m30.0s

running (1m21.9s), 159/200 VUs, 3209 complete and 0 interrupted iterations
default   [  91% ] 159/200 VUs  1m22.0s/1m30.0s

running (1m22.9s), 164/200 VUs, 3368 complete and 0 interrupted iterations
default   [  92% ] 164/200 VUs  1m23.0s/1m30.0s

running (1m23.9s), 169/200 VUs, 3532 complete and 0 interrupted iterations
default   [  93% ] 169/200 VUs  1m24.0s/1m30.0s

running (1m24.9s), 174/200 VUs, 3699 complete and 0 interrupted iterations
default   [  94% ] 174/200 VUs  1m25.0s/1m30.0s

running (1m25.9s), 179/200 VUs, 3873 complete and 0 interrupted iterations
default   [  96% ] 179/200 VUs  1m26.0s/1m30.0s

running (1m26.9s), 184/200 VUs, 4051 complete and 0 interrupted iterations
default   [  97% ] 184/200 VUs  1m27.0s/1m30.0s

running (1m27.8s), 189/200 VUs, 4235 complete and 0 interrupted iterations
default   [  98% ] 189/200 VUs  1m28.0s/1m30.0s

running (1m28.8s), 194/200 VUs, 4424 complete and 0 interrupted iterations
default   [  99% ] 194/200 VUs  1m29.0s/1m30.0s

running (1m29.8s), 199/200 VUs, 4612 complete and 0 interrupted iterations
default   [ 100% ] 199/200 VUs  1m30.0s/1m30.0s

running (1m30.8s), 009/200 VUs, 4811 complete and 0 interrupted iterations
default ↓ [ 100% ] 199/200 VUs  1m30s


  █ TOTAL RESULTS 

    HTTP
    http_req_duration....: avg=2.13ms med=1.54ms min=854.74µs max=57.65ms p(90)=2.75ms p(95)=5.32ms p(99)=13.09ms
    http_req_failed......: 100.00% 19280 out of 19280
    http_reqs............: 19280   212.121706/s

    EXECUTION
    iteration_duration...: avg=1s     med=1s     min=1s       max=1.1s    p(90)=1.01s  p(95)=1.02s  p(99)=1.04s  
    iterations...........: 4820    53.030427/s
    vus..................: 9       min=1              max=199
    vus_max..............: 200     min=200            max=200

    NETWORK
    data_received........: 6.1 MB  67 kB/s
    data_sent............: 3.3 MB  37 kB/s



running (1m30.9s), 000/200 VUs, 4820 complete and 0 interrupted iterations
default ✓ [ 100% ] 000/200 VUs  1m30s